py32-rs/py32-data/svd/PY32F021xx.svd
        <register>
          <name>CALFIR1</name>
          <displayName>CALFIR1</displayName>
          <description>ADC calibration factor input register 1</description>
          <addressOffset>0x50</addressOffset>
          <fields>
            <field>
              <name>CALC4IO</name>
              <description>Calibration C4 factor input</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>CALC5IO</name>
              <description>Calibration C5 factor input</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>CALBIO</name>
              <description>Calibration offset factor input</description>
              <bitRange>[22:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CALFIR2</name>
          <displayName>CALFIR2</displayName>
          <description>ADC calibration factor input register 2</description>
          <addressOffset>0x54</addressOffset>
          <fields>
            <field>
              <name>CALC0IO</name>
              <description>Calibration C0 factor input</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>CALC1IO</name>
              <description>Calibration C1 factor input</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>CALC2IO</name>
              <description>Calibration C2 factor input</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>CALC3IO</name>
              <description>Calibration C3 factor input</description>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR</name>
          <displayName>CCR</displayName>
          <description>ADC common configuration register</description>
          <addressOffset>0x308</addressOffset>
          <fields>
            <field>
              <name>TSVREFINTEN</name>
              <description>Temperature sensor and VREFINT enable</description>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>COMP1</name>
      <description>Comparator</description>
      <groupName>COMP</groupName>
      <baseAddress>0x40010200</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CSR</name>
          <displayName>CSR</displayName>
          <description>COMP control and status register</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>COMP_EN</name>
              <description>COMP enable bit</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>INMSEL</name>
              <description>Comparator signal selector for inverting input INM</description>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>INPSEL</name>
              <description>Comparator signal selector for non-inverting input</description>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>WINMODE</name>
              <description>Comparator non-inverting input selector for window mode</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>POLARITY</name>
              <description>Comparator polarity selector</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>HYST</name>
              <description>Comparator hysteresis enable selector</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>PWRMODE</name>
              <description>Comparator power mode selector</description>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>VCDIV</name>
              <description>Comparator vcdiv</description>
              <bitRange>[25:20]</bitRange>
            </field>
            <field>
              <name>VCDIV_EN</name>
              <description>Comparator vcdiv enable</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>VCSEL</name>
              <description>Comparator vcsel</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>COMP_OUT</name>
              <description>Comparator output status</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>LOCK</name>
              <description>CSR register lock</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FR</name>
          <displayName>FR</displayName>
          <description>Comparator Filterregister</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>FLTEN</name>
              <description>Filter enable bit</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>FLTCNT</name>
              <description>Comparator filter and counter</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
