py32-rs/py32-data/svd/PY32F021xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>FLASH</name>
      <description>Flash</description>
      <groupName>Flash</groupName>
      <baseAddress>0x40022000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>FLASH</name>
        <description>FLASH global Interrupt</description>
        <value>3</value>
      </interrupt>
      <registers>
        <register>
          <name>ACR</name>
          <displayName>ACR</displayName>
          <description>Access control register</description>
          <addressOffset>0x0</addressOffset>
          <resetValue>0x600</resetValue>
          <fields>
            <field>
              <name>LATENCY</name>
              <description>Latency</description>
              <bitRange>[1:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYR</name>
          <displayName>KEYR</displayName>
          <description>Flash key register</description>
          <addressOffset>0x8</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>KEY</name>
              <description>Flash key</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OPTKEYR</name>
          <displayName>OPTKEYR</displayName>
          <description>Option byte key register</description>
          <addressOffset>0xC</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>OPTKEY</name>
              <description>Option byte key</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <displayName>SR</displayName>
          <description>Status register</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>EOP</name>
              <description>End of operation</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>WRPERR</name>
              <description>Write protected error</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USRLOCK</name>
              <description>User data flash lock</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>OPTVERR</name>
              <description>Option and Engineering bits loading validity error</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>BSY</name>
              <description>Busy</description>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <displayName>CR</displayName>
          <description>Flash control register</description>
          <addressOffset>0x14</addressOffset>
          <resetValue>0xC0000000</resetValue>
          <fields>
            <field>
              <name>PG</name>
              <description>Programming</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PER</name>
              <description>Page erase</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>MER</name>
              <description>Mass erase</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SER</name>
              <description>Sector erase</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OPTSTRT</name>
              <description>Option byte program start</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>PGTSTRT</name>
              <description>Flash main memory program start</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>EOPIE</name>
              <description>End of operation interrupt enable</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>ERRIE</name>
              <description>Error interrupt enable</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>OBL_LAUNCH</name>
              <description>Force the option byte loading</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>OPTLOCK</name>
              <description>Options Lock</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>LOCK</name>
              <description>FLASH_CR Lock</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OPTR</name>
          <displayName>OPTR</displayName>
          <description>Flash option register</description>
          <addressOffset>0x20</addressOffset>
          <resetValue>0x4F55B0AA</resetValue>
          <fields>
            <field>
              <name>RDP</name>
              <description>Read Protection</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>IDWG_STOP</name>
              <description>Stop mode IWDG counter</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>IDWG_SW</name>
              <description>Independent watchdog selection</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>WWDG_SW</name>
              <description>Window watchdog selection</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>NRST_MODE</name>
              <description>NRST_MODE</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>nBOOT1</name>
              <description>Boot configuration</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>BOREN</name>
              <description>BOR reset Level</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>BORF_LEV</name>
              <description>These bits contain the VDD supply level threshold that activates the reset</description>
              <bitRange>[19:17]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SDKR</name>
          <displayName>SDKR</displayName>
          <description>Flash SDK address register</description>
          <addressOffset>0x24</addressOffset>
          <resetValue>0xFFE0001F</resetValue>
          <fields>
            <field>
              <name>SDK_STRT</name>
              <description>SDK area start address</description>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>SDK_END</name>
              <description>SDK area end address</description>
              <bitRange>[12:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>WRPR</name>
          <displayName>WRPR</displayName>
          <description>Flash WRP addressregister</description>
          <addressOffset>0x2C</addressOffset>
          <resetValue>0xFFFF</resetValue>
          <fields>
            <field>
              <name>WRP</name>
              <description>WRP address</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STCR</name>
          <displayName>STCR</displayName>
          <description>Flash sleep time configregister</description>
          <addressOffset>0x90</addressOffset>
          <resetValue>0x6400</resetValue>
          <fields>
            <field>
              <name>SLEEP_EN</name>
              <description>FLash sleep enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SLEEP_TIME</name>
              <description>FLash sleep time configuration(counter based on HSI_10M)</description>
              <bitRange>[15:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TS0</name>
          <displayName>TS0</displayName>
          <description>Flash TS0 register</description>
          <addressOffset>0x100</addressOffset>
          <resetValue>0xB4</resetValue>
          <fields>
            <field>
              <name>TS0</name>
              <description>FLash TS0 register</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TS1</name>
          <displayName>TS1</displayName>
          <description>Flash TS1 register</description>
          <addressOffset>0x104</addressOffset>
          <resetValue>0x1B0</resetValue>
          <fields>
            <field>
              <name>TS1</name>
              <description>FLash TS1 register</description>
              <bitRange>[8:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TS2P</name>
          <displayName>TS2P</displayName>
          <description>Flash TS2P register</description>
          <addressOffset>0x108</addressOffset>
          <resetValue>0xB4</resetValue>
          <fields>
            <field>
              <name>TS2P</name>
              <description>FLash TS2P register</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TPS3</name>
          <displayName>TPS3</displayName>
          <description>Flash TPS3 register</description>
          <addressOffset>0x10C</addressOffset>
          <resetValue>0x6C0</resetValue>
          <fields>
            <field>
              <name>TPS3</name>
              <description>FLash TPS3 register</description>
              <bitRange>[10:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TS3</name>
          <displayName>TS3</displayName>
          <description>Flash TS3 register</description>
          <addressOffset>0x110</addressOffset>
          <resetValue>0xB4</resetValue>
          <fields>
            <field>
              <name>TS3</name>
              <description>FLash TS3 register</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PERTPE</name>
          <displayName>PERTPE</displayName>
          <description>Flash PERTPE register</description>
          <addressOffset>0x114</addressOffset>
          <resetValue>0xEA60</resetValue>
          <fields>
            <field>
              <name>PERTPE</name>
              <description>FLash PERTPE register</description>
              <bitRange>[16:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SMERTPE</name>
          <displayName>SMERTPE</displayName>
          <description>Flash SMERTPE register</description>
          <addressOffset>0x118</addressOffset>
          <resetValue>0xFD20</resetValue>
          <fields>
            <field>
              <name>SMERTPE</name>
              <description>FLash SMERTPE register</description>
              <bitRange>[16:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRGTPE</name>
          <displayName>PRGTPE</displayName>
          <description>Flash PRGTPE register</description>
          <addressOffset>0x11C</addressOffset>
          <resetValue>0x8CA0</resetValue>
          <fields>
            <field>
              <name>PRGTPE</name>
              <description>FLash PRGTPE register</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRETPE</name>
          <displayName>PRETPE</displayName>
          <description>Flash PRETPE register</description>
          <addressOffset>0x120</addressOffset>
          <resetValue>0x12C0</resetValue>
          <fields>
            <field>
              <name>PRETPE</name>
              <description>FLash PRETPE register</description>
              <bitRange>[12:0]</bitRange>
            </field>
          </fields>
        </register>
