py32-rs/py32-data/svd/PY32F021xx.svd
        <register>
          <name>APBENR1</name>
          <displayName>APBENR1</displayName>
          <description>APB peripheral clock enable register1</description>
          <addressOffset>0x3C</addressOffset>
          <fields>
            <field>
              <name>TIM2EN</name>
              <description>TIM2 timer clock enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RTCAPBEN</name>
              <description>RTC APB clock enable</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>WWDGEN</name>
              <description>WWDG clock enable</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SPI2EN</name>
              <description>SPI2 clock enable</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>USART2EN</name>
              <description>USART2 clock enable</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>I2C1EN</name>
              <description>I2C1 clock enable</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>DBGEN</name>
              <description>Debug support clock enable</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>PWREN</name>
              <description>Power interface clock enable</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>OPAEN</name>
              <description>OPA clock enable</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>LPTIMEN</name>
              <description>LPTIM clock enable</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>APBENR2</name>
          <displayName>APBENR2</displayName>
          <description>APB peripheral clock enable register2</description>
          <addressOffset>0x40</addressOffset>
          <fields>
            <field>
              <name>SYSCFGEN</name>
              <description>SYSCFG, COMP and VREFBUF clock enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TIM1EN</name>
              <description>TIM1 timer clock enable</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SPI1EN</name>
              <description>SPI1 clock enable</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>USART1EN</name>
              <description>USART1 clock enable</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>TIM14EN</name>
              <description>TIM14 timer clock enable</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>TIM16EN</name>
              <description>TIM16 timer clock enable</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>TIM17EN</name>
              <description>TIM16 timer clock enable</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>ADCEN</name>
              <description>ADC clock enable</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>COMP1EN</name>
              <description>COMP1 clock enable</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>COMP2EN</name>
              <description>COMP2 clock enable</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>LCDEN</name>
              <description>LCD clock enable</description>
              <bitRange>[24:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCIPR</name>
          <displayName>CCIPR</displayName>
          <description>Peripherals independent clock configurationregister</description>
          <addressOffset>0x54</addressOffset>
          <fields>
            <field>
              <name>TIMCLKCTRL</name>
              <description>TIMER PCLK frequency control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PVDSEL</name>
              <description>PVD detect clock source selection</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>COMP1SEL</name>
              <description>COMP1 clock source selection</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>COMP2SEL</name>
              <description>COMP2 clock source selection</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>LPTIM1SEL</name>
              <description>LPTIM1 clock source selection</description>
              <bitRange>[19:18]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BDCR</name>
          <displayName>BDCR</displayName>
          <description>RTC domain control register</description>
          <addressOffset>0x5C</addressOffset>
          <fields>
            <field>
              <name>RTCSEL</name>
              <description>RTC clock source selection</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>RTCEN</name>
              <description>RTC clock source enable</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>BDRST</name>
              <description>RTC domain software reset</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>LSCSEL</name>
              <description>Low-speed clock selection</description>
              <bitRange>[25:25]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR</name>
          <displayName>CSR</displayName>
          <description>Control/status register</description>
          <addressOffset>0x60</addressOffset>
          <fields>
            <field>
              <name>LSION</name>
              <description>LSI oscillator enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LSIRDY</name>
              <description>LSI oscillator ready</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RMVF</name>
              <description>Remove reset flags</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>OBLRSTF</name>
              <description>Option byte loader reset flag</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>PINRSTF</name>
              <description>Pin reset flag</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>PWRRSTF</name>
              <description>BOR or POR/PDR flag</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>SFTRSTF</name>
              <description>Software reset flag</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>IWDGRSTF</name>
              <description>Independent window watchdog reset flag</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>WWDGRSTF</name>
              <description>Window watchdog reset flag</description>
              <bitRange>[30:30]</bitRange>
            </field>
          </fields>
        </register>
